Repository: Libisch/tumuli
Catalog: biography/locale/*/LC_MESSAGES/django.po
Languages: he

source: Birth
he: לידה

source: Passing
he: פטירה

source: Biography
he: ביוגרפיה

source: Author
he: מחבר

source: Period
he: תקופה

source: Content
he: תוכן

source: Story Audio
he: שמע הסיפור

source: Story Text
he: מלל הסיפור

source: context and description of the dump
he: תיאור וקונטקסט

source: Memoir
he: זכרון

source: Memoirs
he: זכרונות

source: Place
he: מקום

source: Start Date
he: תאריך התחלה

source: End Date
he: תאריך סיום

source: Periods
he: תקופות

source: Date of birth
he: תאריך לידה

source: Date of passing
he: תאריך פטירה

source: Place of birth
he: מקום לידה

source: Place of passing
he: מקום פטירה

source: Person
he: אדם

source: all other personal data is stored on the user
he: כל שאר המידע האישי שמור במשתמש

source: Editors
he: עורכים

source: the good people that can edit this biography
he: העורכים שיכולים לערוך את הביוגרפיה

source: Public
he: ציבורי

source: Is it public?
he: האם ציבורי?

source: Biographies
he: ביוגרפיות

source: Owner
he: בעלים

source: Import date
he: תאריך יבוא

source: Who
he: מי

source: who is in the atom?
he: מי מופיע בתמונה/במה עוסק המסמך

source: Original Date
he: תאריך המקור

source: When was this atom made?
he: מתי צולמה/נחתם

source: Image
he: תמונה/מסמך

source: Content Atom
he: פריט תוכן

source: Content Atoms
he: פרטי תוכן
